# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [6]:
series1=pd.Series(np.random.randint(1,5,(100)))
series2=pd.Series(np.random.randint(1,4,(100)))
series3=pd.Series(np.random.randint(10000,30001,(100)))
series1,series2,series3

(0     3
 1     1
 2     4
 3     2
 4     4
      ..
 95    1
 96    4
 97    2
 98    1
 99    2
 Length: 100, dtype: int32,
 0     1
 1     2
 2     2
 3     1
 4     2
      ..
 95    2
 96    3
 97    2
 98    1
 99    1
 Length: 100, dtype: int32,
 0     24399
 1     17933
 2     16571
 3     14855
 4     18532
       ...
 95    12457
 96    27965
 97    26900
 98    10479
 99    29813
 Length: 100, dtype: int32)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [7]:
housemkt = pd.concat([series1,series2,series3], axis=1)
housemkt.head()

   0  1      2
0  3  1  24399
1  1  2  17933
2  4  2  16571
3  2  1  14855
4  4  2  18532

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [8]:
housemkt.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      3       1            24399
1      1       2            17933
2      4       2            16571
3      2       1            14855
4      4       2            18532

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [9]:
bigcolumn=pd.concat([series1,series2,series3],axis=0)
bigcolumn=bigcolumn.to_frame()
bigcolumn

        0
0       3
1       1
2       4
3       2
4       4
..    ...
95  12457
96  27965
97  26900
98  10479
99  29813

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [10]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [12]:
bigcolumn.reset_index(drop=True,inplace=True)

In [13]:
bigcolumn

         0
0        3
1        1
2        4
3        2
4        4
..     ...
295  12457
296  27965
297  26900
298  10479
299  29813

[300 rows x 1 columns]